[{"Name":"Robin Lawrence (1892 - 1968)","Description":"Pioneering medical scientist. Soon after qualifying as a medical doctor Lawrence was diagnosed with diabetes. At the time, in the early 20th century, a disease such as this was normally fatal. Having moved to Florence to spend his remaining time there he was called back to Britain by his friend G.Harrison at King's College Hospital, London, with the message 'I have got some insulin. It works. Come back quick.'\n\nLawrence quickly learned how to manage diabetes and became a leading specialist in the field. His books, The Diabetic Life and The Diabetic ABC both ran to numerous editions. He and his close friends are credited with creation of the Diabetic Department at King's College Hospital, of which he subsequently became head. In 1934 with the public support of his friend and patient the novelist H.G.Wells he founded the Diabetic Association, now the British Diabetic Association. He was the Chairman of its executive council from 1934 to 1961. In 1950 he was involved in founding the International Diabetic Federation, of which body he was President until 1958.","Category":"Plaques","Latitude":"57.1369526","Longitude":"-2.1039839","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"George Russell Gowans (1843 - 1924)","Description":"Artist. Born in 1843 at Woodside and served his apprenticeship at Keith & Gibb lithographers, along with fellow artist Sir George Reid and John Bulloch, editor of Scottish Notes and Queries and various volumes of the New Spalding Club.  A winner of a National Medal for Success in Art from South Kensington in 1879, Gowans also became a Master Teacher of Art in that same year.  He was a founding member in 1885 of Aberdeen Artists’ Society. In 1893 he was elected to the Royal Scottish Society of Painters in Watercolours (RSW) and at one time served as a member of the Hanging Committee. Gowans was active in the Northern Arts Club, serving as its Vice President in 1910-12.  His marriage to Jessie Ann Reid in 1886 was officiated by H.W. Wright, Minister of Ferryhill, and the couple lived first at 267 Union Street, then at 36 Holburn Street, and finally at 119 Broomhill Road.  Gowans is remembered mainly as a landscape artist of North East Scotland although his work covers many areas of Scotland, England and northern France, particularly Normandy and Picardy. He died in 1924, one year after the death of his wife","Category":"Plaques","Latitude":"57.133455","Longitude":"-2.1213335","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"William Meff (1861 - 1935)","Description":"Lord Provost of Aberdeen. Born in Aberdeen in 1861, his father, also William, was a trawler owner. Both the younger William and his brother began their careers working in their father's business.  Subsequently the two brothers set up their own highly successful firm, Meff Bros. He rose to become chairman and director of large number of harbour related firms, such as the Bon-Accord Ice Company and the Aberdeen Mutual and General Marine Insurance Company. He entered public life as a Harbour Commissioner (on which board he sat for 27 years) and subsequently was elected as Councillor for the then newly incorporated Torry Ward (1894-1911). For many years he was Shoremaster at a time of great harbour changes (such as the creation of Albert Basin and Victoria and Upper Docks) and has been called ‘maker of the Harbour'. In his later political career he held most of the high offices in Aberdeen, such as Dean of Guild, Treasurer and was twice Lord Provost. In his role as chief magistrate he oversaw many important changes to Aberdeen, including the purchase of Hazlehead Estate to form a park for the city.","Category":"Plaques","Latitude":"57.1371815","Longitude":"-2.1097937","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Meredith Brown (1845 - 1908)","Description":"Social reformer. Born in 1845 in Glasgow and brought up in Aberdeen","Category":"Plaques","Latitude":"57.1433609","Longitude":"-2.1036801","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"James McBey (1883 - 1959)","Description":"Artist. Born in 1883 in Foveran, Aberdeenshire. He left school at the age of 15 and entered service in the North of Scotland Bank. At age 27 he left the bank in order to make a proper living from his art. In 1916 he was appointed to a position in the Army Printing and Stationery Department. He later became an official War Artist. In 1929 he met his future wife Marguerite Loeb in America. They purchased property in Tangier in 1932. He is remembered mainly as an artist of the Middle East although his work covers many areas. He died on 1 December 1959 and was survived by his wife, an artist in her own right, who died in October 1999.","Category":"Plaques","Latitude":"57.1401943","Longitude":"-2.122092","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Thomas Fraser (1872 - 1951)","Description":"Medical pioneer. Born and educated in Aberdeen. During the First World War he served in Egypt, Gallipoli and France in various medical capacities, attaining the final rank of Acting Colonel, with five ‘mentions in dispatches’. Fraser was involved in the discovery of insulin as a treatment for diabetes. Between 1937 and 1938 he served as President of the British Medical Association. He died in 1951.","Category":"Plaques","Latitude":"57.1431131","Longitude":"-2.1263644","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"John Morgan (1844 - 1907)","Description":"Master Mason.  Born in Craigton, Aberdeenshire, Morgan became an apprentice builder in 1862. In his long and varied career he was responsible for a number of notable buildings, including the frontage to Marischal College, Canada House, the Guild Street Railway Building, the Central Library and the Northern Insurance Building (known locally as the monkey house). He was also a councillor from 1885-1892, during which time he was involved in planning Rosemount Viaduct.\r\n\r\n\r\nIn 1887 he built Rubislaw House for himself, which he co-designed with the architect John Pirie. The plaque is erected on Rubislaw House between the marks of Morgan and Pirie.","Category":"Plaques","Latitude":"57.1425469","Longitude":"-2.163086","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"James Leatham (1865 - 1945)","Description":"Socialist, journalist and propagandist. Born in Aberdeen, Leatham was apprenticed to a firm of printers and then established his own printing shop in 1889. A militant advocate of free speech, he published The Workers Herald, Scotland’s first socialist newspaper and became editor of The Peterhead Sentinel  in 1897. Leatham served as Provost of Turriff 1933-1945.","Category":"Plaques","Latitude":"57.147855","Longitude":"-2.1007168","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"John Phillip (1817 - 1867)","Description":"Artist. Born at 13 Skene Square. He began his career reputedly as a house painter and glazier. In 1837 he moved to London where he entered the Royal Academy Schools. He was a member of an artistic group called the 'Clique'. He became an honorary Royal Scottish Academician in 1857 and a Royal Academician in 1859. Throughout his career, Phillip painted Scottish genre scenes, in the tradition of Sir David Wilkie. From 1851, a series of visits to Spain inspired him to paint colourful and vibrant scenes of Spanish life. Queen Victoria particularly favoured his work and he enjoyed many Royal commissions. By 1897, Phillip's standing as one of Britain's most sought after artists was confirmed when the painting La Gloria","Category":"Plaques","Latitude":"57.150928","Longitude":"-2.1080499","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"George Jamesone (1588 - 1644)","Description":"There are two plaques at this location. Portrait Painter. Born in Aberdeen, it is believed that he studied with Rubens in Antwerp. He was Scotland’s first indigenous portrait painter of any note and was commissioned to paint a portrait of Charles I at his coronation in 1633","Category":"Plaques","Latitude":"57.147855","Longitude":"-2.1007168","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"James Fenton Wyness (1903 - 1974)","Description":"Architect and Historian. He is remembered as an architect and antiquarian who was committed to local issues and one who specialised in the restoration of historic buildings. He was the project architect, editor and historical advisor for the Deeside Field and published a history of Aberdeen, City by the Grey North Sea, in 1965. He became the County Commissioner for the Boy Scouts and was awarded the Silver Wolf, Scouting’s highest honour in 1973. He was also a Knight of the Order of St John.","Category":"Plaques","Latitude":"57.1342401","Longitude":"-2.1243195","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"George Washington Wilson (1823 - 1893)","Description":"Photographer Royal. The son of a Banffshire crofter, he studied Art in London and Paris where he worked first as a miniaturist and then set up a photographic partnership in 1852. He rose to fame with his photographs of the Royal Family and scenes associated with Royal residences.","Category":"Plaques","Latitude":"57.1430997","Longitude":"-2.12694688606383","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"John Forbes White (1831 - 1904)","Description":"Flour Merchant and Patron of the Arts. Educated at Aberdeen Grammar School and Marischal College he became an innovative flour miller and corn merchant. He held the Directorship of the North of Scotland Bank and Aberdeen Jute Company, became President of the British and Irish Association of Millers in 1888 and was Vice-Consul for Sweden and Norway. White was awarded an honorary LLD from Aberdeen University in 1886. He is also remembered as a pioneer amateur photographer and sponsor of Aberdeen Art Gallery. He was also an influential writer on art, a collector of innovative contemporary art and patron to many young artists whose career flourished as a result.","Category":"Plaques","Latitude":"57.1502171","Longitude":"-2.0919669","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"James Cromar Watt (1862 - 1940)","Description":"Architect, Enameller and Botanist. Born in Aberdeen and educated at Aberdeen Grammar School, he was articled to an Aberdeen architect’s firm and later awarded the Royal Institute of British Architects’ gold medal. He is remembered mainly as a jeweller who used gold granulation and foiled enamelling. Watt exhibited widely in Scotland and abroad and was awarded an honorary LLD from Aberdeen University in 1937.","Category":"Plaques","Latitude":"57.1433609","Longitude":"-2.1036801","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"George Thomson (1804 - 1895)","Description":"Clipper Ship Owner. Born in Woolwich and educated at Aberdeen Grammar School, he developed his own business as a Ship Insurance Broker in 1825. He became principal owner of the world famous shipping line The Aberdeen White Star Line, which included the fast tea clipper the Thermopylae. He was elected Dean of Guild in 1840 and Lord Provost of Aberdeen in 1847.","Category":"Plaques","Latitude":"57.1463775","Longitude":"-2.0915861","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Helena Mennie Shire (1912 - 1991)","Description":"Scholar of the Literature and Music of Scotland. Born in Aberdeen and educated at Aberdeen and Cambridge Universities, she taught in the English faculty at Cambridge where she researched medieval and renaissance music and literature. She was appointed Emeritus Fellow of Robinson College in 1980.","Category":"Plaques","Latitude":"57.1569391","Longitude":"-2.1125157","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Thomas Scott Sutherland (1899 - 1964)","Description":"Architect, Entrepreneur and Benefactor of the Robert Gordon University. Born in Torry and educated at Robert Gordon’s College, he qualified as an architect in 1922. He established his own practice and enjoyed considerable success in Aberdeen and the North East, including the creation of Aberdeen’s Regent Cinema in 1932. As a local councillor he was responsible for improving housing standards within Aberdeen. Founder of the Scott Sutherland School of Architecture at Robert Gordon University.","Category":"Plaques","Latitude":"57.1431131","Longitude":"-2.1263644","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Jeannie Robertson (1908 - 1975)","Description":"Traditional Scottish Folk Singer. Born in Aberdeen of travelling folk, she spent much of her childhood in Deeside and Perthshire, where she acquired a vast repertoire of traditional music. A folk singer of unique ability, she was made an MBE in 1968 for her contribution to Scottish traditional music and in recognition of her international fame.","Category":"Plaques","Latitude":"57.1666926","Longitude":"-2.1321344","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Captain William Penny (1809 - 1892)","Description":"Whaler and Arctic Explorer. An innovative whaler who developed the use of new fishing grounds in the Davis Straits and established a good working relationship with the native Inuit, he pioneered techniques for over wintering in the Arctic on board ship. He is best remembered for his efforts to discover the fate of the Franklin expedition which left Britain in 1846 looking for the North-West Passage.","Category":"Plaques","Latitude":"57.1371063","Longitude":"-2.1009163","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"James Matthews (1820 - 1898)","Description":"Architect and Lord Provost of Aberdeen. Educated at Robert Gordon’s Hospital he began his career as an assistant with Archibald Simpson’s Architectural Practice. He set up a partnership with A. Marshall MacKenzie and designed Albyn Terrace, Aberdeen Music Hall, the Tivoli Theatre and Langstane Kirk. Matthews entered local government in 1863 and was elected Lord Provost in 1883.","Category":"Plaques","Latitude":"57.1431459","Longitude":"-2.1217224","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"John James Rickard MacLeod (1876 - 1935)","Description":"Physiologist. Born in Cluny Perthshire and educated at Aberdeen Grammar School and Marischal College he was appointed Professor of Physiology at Cleveland, Ohio in 1903. He was awarded, jointly, the Nobel Prize for Medicine and Physiology in 1923 for the discovery of insulin.","Category":"Plaques","Latitude":"57.1144001","Longitude":"-2.1962682","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Robert Laws (1851 - 1934)","Description":"Pioneer of African Education. Born in Aberdeen he graduated from Aberdeen University and Edinburgh United Presbyterian Theological College. He was ordained a medical missionary in the Livingstonia Mission and founded the Hope Waddel Institute at Calabar, West Africa.","Category":"Plaques","Latitude":"57.1441385","Longitude":"-2.1099298","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"William Kennedy (1758 - 1836)","Description":"Lawyer and Historian. Born in Aberdeen he practised as a lawyer in the city. He is best known as a local historian who compiled a three-volume alphabetical index to the council registers of Aberdeen City Council from 1398-1836. He is principally remembered as author of the two volume Annals of Aberdeen.","Category":"Plaques","Latitude":"57.1463775","Longitude":"-2.0915861","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Catherine Hollingworth (1904 - 1999)","Description":"Speech Therapist and Child Drama Pioneer. Born in Brechin and educated at the Royal Academy of Music she became Aberdeen's first teacher of speech in 1941. In 1942 she created the Abredeen Children's Theatre which attracted international recognition for its pioneering work in the field of child drama.","Category":"Plaques","Latitude":"57.1557604","Longitude":"-2.0951576","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Lewis Grassic Gibbon (1901 - 1935)","Description":"Novelist. Born in Auchterless and educated at Mackie Academy. He then became a journalist for the Aberdeen Journal and later was a clerk for the RAF. He is best remembered for his notable trilogy A Scots Quair. He is generally recognised as one of the greatest twentieth century Scottish authors.","Category":"Plaques","Latitude":"57.1427628","Longitude":"-2.1011209","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Alexander Gordon (1752 - 1799)","Description":"Obstetrician. Born in Peterculter he gained his MA at Marischal College before reading medicine at Aberdeen Infirmary, Edinburgh and Leiden. He worked as a surgeon in HM Navy prior to studying midwifery in London. Gordon was appointed physician to the Aberdeen Dispensary in 1785 and published A Treatise on the Epidemic Puerperal Fever of Aberdeen, 1795.","Category":"Plaques","Latitude":"57.1478145","Longitude":"-2.102293","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Sir David Gill (1843 - 1914)","Description":"Astronomer. Born in Aberdeen and educated at Aberdeen Grammar School and Marischal College, he took the first photographs of the moon in 1868. He was appointed Her Majesty's Astronomer at the Cape of Good Hope in 1879 and elected Fellow of the Royal Society.Download the story of Sir David Gill","Category":"Plaques","Latitude":"57.1475289","Longitude":"-2.1065237","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"James William Giles (1801 - 1870)","Description":"Artist. He founded the Aberdeen Artists Society in 1827 and was elected an Academician of the Royal Scottish Academy in 1829. He is best known for his paintings of Aberdeenshire castellated buildings and as a landscape architect.","Category":"Plaques","Latitude":"57.1411288","Longitude":"-2.1042557","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Mary Garden (1874 - 1967)","Description":"Opera Singer. Born in Aberdeen she trained in Paris, where she joined the Opera-Comique. She sang the lead role in Gustave Charpentier's opera Louise in 1900 and enjoyed unrivalled success until her retirement in 1934. Mary Garden will be remembered as the composer's choice to create the role of Melisande in Debussy's Pelleas et Melisande.","Category":"Plaques","Latitude":"57.1433609","Longitude":"-2.1036801","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Ian Fleming (1906 - 1994)","Description":"Artist. He is best known as an engraver and etcher but he also played a fundamental part in the visual arts in Aberdeen. His career spanned almost an entire century as a painter, printmaker and teacher at Glasgow School of Art and later at Gray's School of Art in Aberdeen where he was Head of School.","Category":"Plaques","Latitude":"57.1371815","Longitude":"-2.1097937","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Elizabeth Latto Ewen (1875 - 1965)","Description":"Aberdeen's First Female General Practitioner. Born in Fyvie she studied in Edinburgh and Dublin before returning to Aberdeen to open the city's first Ladies' Medical Practice in Chapel Street in 1896. She also worked as a medical examiner for the Colonial Mutual Assurance Society and became the first woman member of the local branch of the British Medical Association.","Category":"Plaques","Latitude":"57.1436143","Longitude":"-2.1098118","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Mary Esslemont (1891 - 1984)","Description":"General Practitioner. Born in Aberdeen she studied at Aberdeen University and became the first woman president of the Student's Representative Council in 1923. She qualified as a General Practitioner, worked as a Justice of the Peace and was elected President of the Medical Women's Association and President of the Soroptimists of Great Britain and Ireland. Esslemont was made a CBE in 1955 and awarded the degree of LLD from Aberdeen University. She is also honoured as a Free Burgess of the City of Aberdeen.","Category":"Plaques","Latitude":"57.1493162","Longitude":"-2.1236205","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Alexander Ellis (1830 - 1917)","Description":"Architect. Born in Aberdeen and educated at Robert Gordon's Hospital and Aberdeen University, he trained with William Smith, City Architect. He set up his own business and then formed a partnership with R.G. Wilson which lasted until 1895. Ellis is best remembered for his work on ecclesiastical buildings including churches in Aberdeen, Dundee, Banff, Ellon, Fraserburgh and the west wing of Blair's College.","Category":"Plaques","Latitude":"57.1409789","Longitude":"-2.1013483","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"William Dyce (1806 - 1864)","Description":"Artist. Educated at Aberdeen Grammar School and Marischal College. He worked with oil and watercolour, in fresco, and designed stained glass. His finest easel pictures are of religious subjects. He was elected an Associate of the Royal Scottish Academy in 1835. He is remembered as a leader of the High Church Movement and as a chorister and composer.","Category":"Plaques","Latitude":"57.1463775","Longitude":"-2.0915861","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"James Cowie (1886 - 1956)","Description":"Artist and Head of Painting at Gray's School of Art. Born near Monquhitter, Aberdeenshire, Cowie attended Aberdeen University before pursuing a career as an artist in Glasgow, Aberdeen and Arbroath. He was appointed Head of Painting at Gray's School of Art in 1935 and was elected an Associate of the Royal Scottish Academy in 1936 and Academician in 1943.","Category":"Plaques","Latitude":"57.1371815","Longitude":"-2.1097937","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Sir John Ninian Comper (1864 - 1960)","Description":"Church Architect. Born in Aberdeen, the son of an Episcopalian clergyman, he was educated at Trinity College, Glenalmond. He studied art at Edinburgh, Oxford and the Royal College of Art London, and was apprenticed to an Ecclesiastical Architect's Practice in 1887. He designed the chapel of the Convent of St Margaret of Scotland, Spital in 1891 and the Seabury Memorial Restoration, St Andrew's Cathedral.","Category":"Plaques","Latitude":"57.1589862","Longitude":"-2.0996722","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Ronald Center (1913 - 1973)","Description":"Composer. Born in Aberdeen, he served as Organist at High Hilton Church and taught at The Gordon Schools, Huntly. He is remembered as a composer of string quartets and piano works, Lachrymae for string orchestra and the cantata Dona Nobis Pacem.","Category":"Plaques","Latitude":"57.15858955","Longitude":"-2.1062878","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"John Barbour (1316 - 1395)","Description":"Poet and Author. In 1357 he became the Archdeacon of St Machar's Cathedral, Aberdeen, and travelled frequently to Oxford to study. He was the author of the metrical The Brus, a life of Robert the Bruce and the now lost A Chronicle of Scottish History.","Category":"Plaques","Latitude":"57.1476253","Longitude":"-2.094057","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Lady May Baird (1901 - 1983)","Description":"Social Pioneer. Born in Lanarkshire and a graduate of Glasgow University Lady May was Chair of The North Eastern Regional Hospital Board for 18 years. She was a champion of Health Service improvement, and with her husband was honoured as a Free Burgess of Aberdeen.","Category":"Plaques","Latitude":"57.1431131","Longitude":"-2.1263644","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"Sir Dugald Baird (1899 - 1986)","Description":"Medical Pioneer. Born in Greenock and a graduate of Glasgow University he was appointed to the chair of Obstetrics and Gynaecology at Aberdeen University in 1937. Under his directorship the University's Obstetric Medical Research Unit was set up. He was a principal supporter of the 1967 Abortion Bill.","Category":"Plaques","Latitude":"57.1431131","Longitude":"-2.1263644","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false},{"Name":"William Alexander (1826 - 1894)","Description":"Writer and Journalist. Born near Pitcaple, Aberdeenshire, he joined the staff of the North of Scotland Gazette, later the Aberdeen Free Press, in 1852 and became editor in 1870. He published novels serially in that newspaper and is remembered as the author of Johnny Gibb of Gushetneuk.","Category":"Plaques","Latitude":"57.1501876","Longitude":"-2.121541","Url":null,"HasFee":false,"TelephoneNumber":null,"IsAccessible":false,"HasParking":false}]